PKS1C/src/Documents/РегистрацияККТ/РегистрацияККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияККТ</name>
  <basedOn>Document.РегистрацияККТ</basedOn>
  <registerRecords>InformationRegister.ДатыФН</registerRecords>
  <registerRecords>InformationRegister.КарточкиРегистрацийККТ</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйНакопитель</name>
    <type>
      <types>CatalogRef.ФискальныеНакопители</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ККТ</name>
    <type>
      <types>CatalogRef.КонтрольноКассоваяТехника</types>
    </type>
  </attributes>
  <attributes>
    <name>Автономность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОператорФискальныхДанных</name>
    <type>
      <types>CatalogRef.ОператорыФискальныхДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйПризнак</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияФП</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерФД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерККТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныПеререгистрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТРайон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТГород</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТНаселенныйПункт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТРегион</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТУлица</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТДом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТКорпус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТКвартира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТМестоПрименения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СведенияОбИспользованииККТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РегистрацияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗакрытияФН</name>
    <type>
      <types>DocumentRef.РегистрацияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СведенияОбСНО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТРегионНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТКвартираТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТКорпусТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресККТДомТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФФД</name>
    <type>
      <types>EnumRef.ВерсииФФД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

PKS1C/src/InformationRegisters/ДатыФН/ДатыФН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыФН</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФискальныйНакопитель</name>
    <type>
      <types>CatalogRef.ФискальныеНакопители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/InformationRegisters/КарточкиРегистрацийККТ/КарточкиРегистрацийККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкиРегистрацийККТ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРегистрацииККТ</types>
    </type>
  </resources>
  <dimensions>
    <name>ККТ</name>
    <type>
      <types>CatalogRef.КонтрольноКассоваяТехника</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФН</name>
    <type>
      <types>CatalogRef.ФискальныеНакопители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Enums/ВидыОперацийККТ/ВидыОперацийККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийККТ</name>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>Перерегистрация</name>
  </enumValues>
  <enumValues>
    <name>Закрытие</name>
  </enumValues>
</mdclass:Enum>

PKS1C/src/Enums/СтатусыРегистрацииККТ/СтатусыРегистрацииККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРегистрацииККТ</name>
  <enumValues>
    <name>Зарегистрирована</name>
  </enumValues>
  <enumValues>
    <name>Перерегистрирована</name>
  </enumValues>
  <enumValues>
    <name>СнятаСРегистрации</name>
  </enumValues>
</mdclass:Enum>

PKS1C/src/Documents/РегистрацияККТ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ДатыФН.Записывать = Истина;
	Движение = Движения.ДатыФН.Добавить();
	Движение.ФискальныйНакопитель = ФискальныйНакопитель;
	Движение.Клиент = Клиент;
	Движение.СрокДействия = СрокДействия;
	Движение.Период = ТекущаяДата();
	
	Движения.КарточкиРегистрацийККТ.Записывать = Истина;
	Движение = Движения.КарточкиРегистрацийККТ.Добавить();
	Движение.Период = ?(ЗначениеЗаполнено(ДатаФормированияФП),ДатаФормированияФП,Дата);
	Движение.ККТ = ККТ;
	Движение.ФН = ФискальныйНакопитель;
	Движение.РН = РегистрационныйНомерККТ;
	Если ВидОперации = Перечисления.ВидыОперацийККТ.Регистрация Тогда
		Движение.Статус = Перечисления.СтатусыРегистрацииККТ.Зарегистрирована;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийККТ.Перерегистрация Тогда
		Движение.Статус = Перечисления.СтатусыРегистрацииККТ.Перерегистрирована;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийККТ.Закрытие Тогда
		Движение.Статус = Перечисления.СтатусыРегистрацииККТ.СнятаСРегистрации;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЭтотОбъект.ЭтоНовый() Тогда
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ВидОперации <> Перечисления.ВидыОперацийККТ.Закрытие И ЗначениеЗаполнено(ФискальныйНакопитель) Тогда
		ЗапросФН = Новый Запрос;
		ЗапросФН.Текст = 
			"ВЫБРАТЬ
			|	ДатыФН.ФискальныйНакопитель КАК ФискальныйНакопитель
			|ИЗ
			|	РегистрСведений.ДатыФН КАК ДатыФН
			|ГДЕ
			|	ДатыФН.ФискальныйНакопитель = &ФискальныйНакопитель
			|	И ДатыФН.Регистратор <> &Регистратор
			|	И ДатыФН.Период < &Период";
		
		ЗапросФН.УстановитьПараметр("ФискальныйНакопитель", ФискальныйНакопитель); 
		ЗапросФН.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		ЗапросФН.УстановитьПараметр("Период",Дата);
		
		РезультатЗапросаФН = ЗапросФН.Выполнить();
		ВыборкаФН = РезультатЗапросаФН.Выбрать();
		
		Если ВыборкаФН.Следующий() Тогда
			Если ВидОперации = Перечисления.ВидыОперацийККТ.Регистрация Тогда
				Сообщить("Ошибка! Данный фискальный накопитель уже активирован");
				Отказ = Истина;
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийККТ.Закрытие Тогда
				ФН = ВыборкаФН.ФискальныйНакопитель.ПолучитьОбъект();
				ФН.Закрыт = Истина;
				ФН.Записать();
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийККТ.Закрытие И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ФН = ФискальныйНакопитель.ПолучитьОбъект();
		ФН.Закрыт = Истина;
		ФН.Записать();
		Сообщить("Фискальный накопитель " + ФискальныйНакопитель + " успешно закрыт");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидОперации = Перечисления.ВидыОперацийККТ.Закрытие Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ФискальныйНакопитель"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СрокДействия"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Клиент"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ККТ"));
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.АвторизованныйПользователь();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РегистрацияККТ") Тогда
		// Заполнение шапки
		Автономность = ДанныеЗаполнения.Автономность;
		АдресККТГород = ДанныеЗаполнения.АдресККТГород;
		АдресККТДом = ДанныеЗаполнения.АдресККТДом;
		АдресККТДомТип = ДанныеЗаполнения.АдресККТДомТип;
		АдресККТИндекс = ДанныеЗаполнения.АдресККТИндекс;
		АдресККТКвартира = ДанныеЗаполнения.АдресККТКвартира;
		АдресККТКвартираТип = ДанныеЗаполнения.АдресККТКвартираТип;
		АдресККТКорпус = ДанныеЗаполнения.АдресККТКорпус;
		АдресККТКорпусТип = ДанныеЗаполнения.АдресККТКорпусТип;
		АдресККТМестоПрименения = ДанныеЗаполнения.АдресККТМестоПрименения;
		АдресККТНаселенныйПункт = ДанныеЗаполнения.АдресККТНаселенныйПункт;
		АдресККТРайон = ДанныеЗаполнения.АдресККТРайон;
		АдресККТРегион = ДанныеЗаполнения.АдресККТРегион;
		АдресККТРегионНаименование = ДанныеЗаполнения.АдресККТРегионНаименование;
		АдресККТУлица = ДанныеЗаполнения.АдресККТУлица;
		ВидОперации = Перечисления.ВидыОперацийККТ.Перерегистрация;
		//ДатаФормированияФП = ДанныеЗаполнения.ДатаФормированияФП;
		ККТ = ДанныеЗаполнения.ККТ;
		Клиент = ДанныеЗаполнения.Клиент;
		//Комментарий = ДанныеЗаполнения.Комментарий;
		//НомерФД = ДанныеЗаполнения.НомерФД;
		ОператорФискальныхДанных = ДанныеЗаполнения.ОператорФискальныхДанных;
		//ПричиныПеререгистрации = ДанныеЗаполнения.ПричиныПеререгистрации;
		РегистрационныйНомерККТ = ДанныеЗаполнения.РегистрационныйНомерККТ;
		СведенияОбИспользованииККТ = ДанныеЗаполнения.СведенияОбИспользованииККТ;
		СрокДействия = ДанныеЗаполнения.СрокДействия;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		//ДокументЗакрытияФН = ДанныеЗаполнения.Ссылка;
		ФискальныйНакопитель = ДанныеЗаполнения.ФискальныйНакопитель;
		//ФискальныйПризнак = ДанныеЗаполнения.ФискальныйПризнак;
		СведенияОбСНО = ДанныеЗаполнения.СведенияОбСНО;
		КонтактнаяИнформация.Загрузить(ДанныеЗаполнения.КонтактнаяИнформация.Выгрузить());
		ВерсияФФД = ДанныеЗаполнения.ВерсияФФД;
		КодПричиныПеререгистрацииККТФФД = ДанныеЗаполнения.КодПричиныПеререгистрацииККТФФД;
		СведенияОбИспользованииККТПоФФД = ДанныеЗаполнения.СведенияОбИспользованииККТПоФФД;
		ПризнакАгента = ДанныеЗаполнения.ПризнакАгента;
		НомерАвтомата = ДанныеЗаполнения.НомерАвтомата;
		
		Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийККТ.Закрытие Тогда
			ПричиныПеререгистрации = УстановитьБит(ПричиныПеререгистрации,4,Истина);
			КодПричиныПеререгистрацииККТФФД = УстановитьБит(КодПричиныПеререгистрацииККТФФД,0,Истина);
			ДокументЗакрытияФН = ДанныеЗаполнения.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//Фиксация в истории изменений
	АутсорсФункцииДокументовСервер.УстановитьИзменениеДокумента(ЭтотОбъект.Ссылка);
КонецПроцедуры
